test_cases/3d_water/3d_mobyDick/1_mobyDick_kEps_rampUp/0/h
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      h;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.419000E+06;

boundaryField
{
    walls     
    {
        type            zeroGradient;
    }

    inlet            
    {
      type    fixedValue;
      value   uniform 0.419000E+06 ;
    }

    outlet
    {
      type    inletOutlet;
      inletValue uniform 0.419000E+06;
      value uniform 0.419000E+06;
    }
}

// ************************************************************************* //
