test_cases/3d_water/3d_mobyDick/1_mobyDick_kEps_rampUp/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1.2e-4; // sqrt(1.5)*(U*turbIntensity*turbLengthScale)

boundaryField
{
    inlet
    {
        type            calculated;
        value           $internalField;
    }
    
    outlet
    {
        type            calculated;
        value           $internalField;
    }
       
    walls
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           $internalField;
    }
}


// ************************************************************************* //
