test_cases/3d_water/3d_mobyDick/1_mobyDick_kEps_rampUp/0/rho
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 958.37;

boundaryField
{
    walls     
    {
        type            zeroGradient;
    }

    inlet            
    {

      type    thermDensity;  
        inletValue      uniform 958.37;
        value           uniform 958.37;
    }

    outlet
    {
        type    thermDensity;
        inletValue     uniform 2.565; // when vapour at backpressure 
        value          uniform 958.37;
    }
  
 
}

// ************************************************************************* //
