test_cases/3d_water/3d_mobyDick/1_mobyDick_kEps_rampUp/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      motionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

twoDMotion      yes;

dynamicFvMesh  staticFvMesh;

motionSolverLibs ("libfvMotionSolvers.so");

solver   laplaceFaceDecomposition;

diffusivity     quadratic;

frozenDiffusion off;

distancePatches
(
    movingWall
    movingFarfield
    movingSlipWall
    wall
);


// ************************************************************************* //
